tutorials/incompressible/pisoFoam/LES/motorBike/motorBike/system/streamLines
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

streamLines
{
    type            streamLine;

    // Output every
    writeControl    writeTime;
    // writeInterval 10;

    setFormat       vtk; // gnuplot; // xmgr; //raw; //jplot; //csv; //ensight;

    // Track forward (+U) or backward (-U) or both
    direction       forward;

    // Names of fields to sample. Should contain above velocity field!
    fields (p U);

    // Steps particles can travel before being removed
    lifeTime        10000;

    // Number of steps per cell (estimate). Set to 1 to disable subcycling.
    nSubCycle 5;

    // Cloud name to use
    cloudName       particleTracks;

    // Seeding method.
    seedSampleSet
    {
        type        uniform;
        axis        x;  // distance;

        // Note: tracks slightly offset so as not to be on a face
        start       (-1.001 1e-7 0.0011);
        end         (-1.001 1e-7 1.0011);
        nPoints     20;
    }
}


// ************************************************************************* //
